message-cant-embed =
    لم تكن رفل قادرة على تشغيل الفلاش المضمنة في هذه الصفحة.
    يمكنك محاولة فتح الملف في علامة تبويب منفصلة، لتجاوز هذه المشكلة.
panic-title = ﺎﻣ ﺄﻄﺧ ثﺪﺣ ﺪﻘﻟ :(
more-info = ﺮﺜﻛﺃ تﺎﻣﻮﻠﻌﻣ
run-anyway = لﺎﺣ يﺃ ﻰﻠﻋ ﻞﻴﻐﺸﺘﻟﺍ
continue = رﺍﺮﻤﺘﺳﻻﺍ
report-bug = ﺄﻄﺧ ﻦﻋ غﻼﺑﻹﺍ
update-ruffle = ﻞﻓﺭ ﺚﻳﺪﺤﺗ
ruffle-demo = ﻲﺒﻳﺮﺠﺗ ﺐﻳﻭ
ruffle-desktop = ﺐﺘﻜﻤﻟﺍ ﺢﻄﺳ ﺞﻣﺎﻧﺮﺑ
ruffle-wiki = ﻲﻜﻳﻭ ﻞﻓﺭ ضﺮﻋ
enable-hardware-acceleration = يبدو أن تسارع الأجهزة غير مفعل. بينما قد يعمل الروفل، قد يكون بطيئاً بشكل غير معقول. يمكنك معرفة كيفية تمكين تسارع الأجهزة من خلال متابعة هذا الرابط.
view-error-details = ﺄﻄﺨﻟﺍ ﻞﻴﺻﺎﻔﺗ ضﺮﻋ
open-in-new-tab = ةﺪﻳﺪﺟ ﺐﻳﻮﺒﺗ ﺔﻣﻼﻋ ﻲﻓ ﺢﺘﻓ
click-to-unmute = ﻢﺘﻜﻟﺍ ءﺎﻐﻟﻹ ﻂﻐﺿﺍ
error-file-protocol =
    يبدو أنك تقوم بتشغيل رفل على بروتوكول "الملف:".
    هذا لن يعمل لأن المتصفحات تمنع العديد من الميزات من العمل لأسباب أمنية.
    بدلاً من ذلك، ندعوك إلى إعداد خادم محلي أو استخدام عرض الويب أو تطبيق سطح المكتب.
error-javascript-config =
    تعرض رفل إلى مشكلة رئيسية بسبب الإعدادات الخاطئة للجافا سكريبت.
    إذا كنت مسؤول الخادم، نحن ندعوك إلى التحقق من تفاصيل الخطأ لمعرفة سبب المشكلة.
    يمكنك أيضا الرجوع إلى رفل ويكي للحصول على المساعدة.
error-wasm-not-found =
    فشل رفل في تحميل مكون الملف ".wasm" المطلوب.
    إذا كنت مسؤول الخادم، الرجاء التأكد من أن الملف قد تم تحميله بشكل صحيح.
    إذا استمرت المشكلة، قد تحتاج إلى استخدام إعدادات "المسار العام": الرجاء مراجعة رفل ويكي للحصول على المساعدة.
error-wasm-mime-type =
    واجهت رفل مشكلة رئيسية أثناء محاولة التهيئة.
    خادم الويب هذا لا يخدم ملفات ". wasm" مع نوع MIME الصحيح.
    إذا كنت مسؤول الخادم، يرجى مراجعة رفل ويكي للحصول على المساعدة.
error-invalid-swf =
    لا يمكن ل رفل تحليل المِلَفّ المطلوب.
    السبب الأكثر ترجيحا هو أن المِلَفّ المطلوب ليس صالحا.
error-swf-fetch =
    فشل رفل في تحميل ملف فلاش SWF.
    السبب الأكثر احتمالا هو أن الملف لم يعد موجودا، لذلك لا يوجد شيء ليحمله رفل.
    حاول الاتصال بمسؤول الموقع للحصول على المساعدة.
error-swf-cors =
    فشل الروفل في تحميل ملف فلاش SWF.
    من المحتمل أن تم حظر الوصول إلى المنال بواسطة سياسة CORS.
    إذا كنت مسؤول الخادم، يرجى مراجعة رفل ويكي للحصول على المساعدة.
error-wasm-cors =
    فشل رفل في تحميل مكون ملف ".wasm" المطلوب.
    من المحتمل أن تم حظر الوصول إلى المنال بواسطة سياسة CORS.
    إذا كنت مسؤول الخادم، يرجى مراجعة رفل ويكي للحصول على المساعدة.
error-wasm-invalid =
    واجهت رفل مشكلة رئيسية أثناء محاولة التهيئة.
    خادم الويب هذا لا يخدم ملفات ". wasm" مع نوع MIME الصحيح.
    إذا كنت مسؤول الخادم، يرجى مراجعة رفل ويكي للحصول على المساعدة.
error-wasm-download =
    واجهت رفل مشكلة رئيسية أثناء محاولتها التهيئة.
    هذا يمكن أن يحل نفسه في كثير من الأحيان، لذلك يمكنك محاولة إعادة تحميل الصفحة.
    خلاف ذلك، يرجى الاتصال بمدير الموقع.
error-wasm-disabled-on-edge =
    فشل رفل في تحميل مكون الملف ".wasm" المطلوب.
    لإصلاح هذه المشكلة، حاول فتح إعدادات المتصفح الخاص بك، انقر فوق "الخصوصية، البحث، الخدمات"، والتمرير لأسفل، وإيقاف "تعزيز أمانك على الويب".
    هذا سيسمح للمتصفح الخاص بك بتحميل الملفات ".wasm" المطلوبة.
    إذا استمرت المشكلة، قد تحتاج إلى استخدام متصفح أخر.
error-javascript-conflict =
    واجهت رفل مشكلة رئيسية أثناء محاولة التهيئة.
    يبدو أن هذه الصفحة تستخدم كود جافا سكريبت الذي يتعارض مع رفل.
    إذا كنت مسؤول الخادم، فإننا ندعوك إلى محاولة تحميل الملف على صفحة فارغة.
error-javascript-conflict-outdated = ){ $buildDate }:ﺔﻤﻳﺪﻗ ﺔﻴﻟﺎﺤﻟﺍ ﺔﺨﺴﻨﻟﺍ( .ﺔﻠﻜﺸﻤﻟﺍ ﻞﺤﺗ ﺪﻗ ﻲﺘﻟﺍ ﻞﻓﺭ ﻦﻣ ثﺪﺣﺃ ﺔﺨﺴﻧ ﻞﻴﻤﺤﺗ ﺔﻟﻭﺎﺤﻣ ﺎًﻀﻳﺃ ﻚﻨﻜﻤﻳ
error-csp-conflict =
    واجهت رفل مشكلة رئيسية أثناء محاولة التهيئة.
    لا تسمح سياسة أمان المحتوى لخادم الويب هذا بتشغيل مكون ".wasm" المطلوب.
    إذا كنت مسؤول الخادم، يرجى الرجوع إلى رفل ويكي للحصول على المساعدة.
error-unknown = .اﺬﻫ شﻼﻔﻟﺍ ىﻮﺘﺤﻣ ضﺮﻋ ﺔﻟﻭﺎﺤﻣ ءﺎﻨﺛﺃ ﺔﻴﺴﻴﺋﺭ ﺔﻠﻜﺸﻣ لﻭﺭ ﺖﻬﺟﺍﻭ
    { $outdated ->
        [true] .ﻞﻓﺭ ﻦﻣ ثﺪﺣﺃ رﺍﺪﺻﺇ ﻞﻴﻤﺤﺗ ﺔﻟﻭﺎﺤﻣ ءﺎﺟﺮﻟﺍ ،مﺩﺎﺨﻟﺍ لﻭﺆﺴﻣ ﺖﻨﻛ اﺫﺇ ){ $buildDate }:ﺔﻤﻳﺪﻗ ﺔﻴﻟﺎﺤﻟﺍ ﺔﺨﺴﻨﻟﺍ(
       *[false] !ﺄﻄﺨﻟﺍ ﻦﻋ ﻎﻴﻠﺒﺘﻟﺎﺑ ﺖﻤﻗ اﺫﺇ ﺎًﻘﺣ رﺪﻘﻧ ﻦﺤﻧ ﻚﻟﺬﻟ ،اﺬﻫ ثﺪﺤﻳ نﺃ ضﺮﺘﻔﻤﻟﺍ ﻦﻣ ﺲﻴﻟ
    }
